Builder/src/DataProcessors/PartnersBuilder/PartnersBuilder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>PartnersBuilder</name>
</mdclass:DataProcessor>

Builder/src/Catalogs/Partners/Partners.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Partners</name>
  <attributes>
    <name>Tel</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Debt</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Manager</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
</mdclass:Catalog>

Builder/src/DataProcessors/PartnersBuilder/ObjectModule.bsl
Var Object;

#Region Public

Procedure Reset() Export
	
	Object = Catalogs.Partners.CreateItem(); 
	
EndProcedure

Procedure SetTelephone(Tel) Export
	
	Object.Tel = Tel;
	
EndProcedure

Procedure SetManager(Manager) Export
	
	Object.Manager = Manager;
	
EndProcedure

Procedure SetDebt(Debt) Export
	
	Object.Debt = Debt;
	
EndProcedure

Function GetResult()
	
	Return Object;
	
EndFunction

#EndRegion
